# FromRoom Property

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnnotationSymbol..::..FromRoom Property
AnnotationSymbol Class See Also
---
The "From Room" set for the door or window.
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FromRoom | The "From Room" set for the door or window in the last phase of the project. (Inherited from FamilyInstance.) |
| [FromRoom[([( Phase])]) ](c4a37990-0603-50e0-ca97-1cd5449940dd.md "FromRoom Property \(Phase\)") | (Inherited from FamilyInstance.) |

# See Also
AnnotationSymbol Class
AnnotationSymbol Members
Autodesk.Revit.DB Namespace